nohup: ignoring input
loading  ./datasetREDs/train_blur/000_resized ...
loading  ./datasetREDs/train_blur/001_resized ...
loading  ./datasetREDs/train_sharp/000_resized ...
loading  ./datasetREDs/train_sharp/001_resized ...
(20, 180, 320, 3)
(20, 180, 320, 3)
Model: "deblurring_cnn_base_v1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  896       
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  18496     
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  73856     
_________________________________________________________________
conv2d_transpose (Conv2DTran multiple                  147584    
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr multiple                  73792     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr multiple                  18464     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr multiple                  867       
=================================================================
Total params: 333,955
Trainable params: 333,955
Non-trainable params: 0
_________________________________________________________________
Epoch 1/3
1/8 [==>...........................] - ETA: 0s - loss: 0.9867 - mae: 0.5027 - mse: 0.3115 - PSNR: 53.18662/8 [======>.......................] - ETA: 21s - loss: 0.9318 - mae: 0.4534 - mse: 0.2676 - PSNR: 53.90553/8 [==========>...................] - ETA: 24s - loss: 0.8983 - mae: 0.4392 - mse: 0.2491 - PSNR: 54.22134/8 [==============>...............] - ETA: 22s - loss: 0.8798 - mae: 0.4320 - mse: 0.2393 - PSNR: 54.39155/8 [=================>............] - ETA: 17s - loss: 0.8609 - mae: 0.4136 - mse: 0.2238 - PSNR: 54.71876/8 [=====================>........] - ETA: 12s - loss: 0.8461 - mae: 0.3982 - mse: 0.2122 - PSNR: 54.97337/8 [=========================>....] - ETA: 6s - loss: 0.8346 - mae: 0.3940 - mse: 0.2094 - PSNR: 55.0164 8/8 [==============================] - ETA: 0s - loss: 0.8298 - mae: 0.3899 - mse: 0.2075 - PSNR: 55.08248/8 [==============================] - 56s 7s/step - loss: 0.8298 - mae: 0.3899 - mse: 0.2075 - PSNR: 55.0824 - val_loss: 0.7785 - val_mae: 0.3362 - val_mse: 0.1771 - val_PSNR: 55.6542
Epoch 2/3
1/8 [==>...........................] - ETA: 0s - loss: 0.7554 - mae: 0.3540 - mse: 0.1903 - PSNR: 55.32562/8 [======>.......................] - ETA: 22s - loss: 0.7439 - mae: 0.3304 - mse: 0.1706 - PSNR: 55.83053/8 [==========>...................] - ETA: 24s - loss: 0.7291 - mae: 0.3211 - mse: 0.1622 - PSNR: 56.05254/8 [==============>...............] - ETA: 22s - loss: 0.7022 - mae: 0.3077 - mse: 0.1533 - PSNR: 56.31445/8 [=================>............] - ETA: 18s - loss: 0.6735 - mae: 0.2958 - mse: 0.1461 - PSNR: 56.53426/8 [=====================>........] - ETA: 12s - loss: 0.6511 - mae: 0.2896 - mse: 0.1399 - PSNR: 56.73767/8 [=========================>....] - ETA: 6s - loss: 0.6299 - mae: 0.2813 - mse: 0.1349 - PSNR: 56.9059 8/8 [==============================] - ETA: 0s - loss: 0.6220 - mae: 0.2775 - mse: 0.1321 - PSNR: 57.09508/8 [==============================] - 56s 7s/step - loss: 0.6220 - mae: 0.2775 - mse: 0.1321 - PSNR: 57.0950 - val_loss: 0.4350 - val_mae: 0.1573 - val_mse: 0.0522 - val_PSNR: 60.9395
Epoch 3/3
1/8 [==>...........................] - ETA: 0s - loss: 0.3384 - mae: 0.1598 - mse: 0.0539 - PSNR: 60.80782/8 [======>.......................] - ETA: 22s - loss: 0.3329 - mae: 0.1627 - mse: 0.0521 - PSNR: 60.95133/8 [==========>...................] - ETA: 25s - loss: 0.3244 - mae: 0.1724 - mse: 0.0539 - PSNR: 60.81034/8 [==============>...............] - ETA: 22s - loss: 0.3077 - mae: 0.1584 - mse: 0.0468 - PSNR: 61.62435/8 [=================>............] - ETA: 18s - loss: 0.3072 - mae: 0.1566 - mse: 0.0463 - PSNR: 61.62826/8 [=====================>........] - ETA: 12s - loss: 0.3087 - mae: 0.1529 - mse: 0.0449 - PSNR: 61.74937/8 [=========================>....] - ETA: 6s - loss: 0.3012 - mae: 0.1490 - mse: 0.0435 - PSNR: 61.8732 8/8 [==============================] - ETA: 0s - loss: 0.2984 - mae: 0.1476 - mse: 0.0430 - PSNR: 61.96778/8 [==============================] - 56s 7s/step - loss: 0.2984 - mae: 0.1476 - mse: 0.0430 - PSNR: 61.9677 - val_loss: 0.3202 - val_mae: 0.0977 - val_mse: 0.0264 - val_PSNR: 63.9188
WARNING:tensorflow:From /home/maniezzo/.local/lib/python3.6/site-packages/tensorflow/python/ops/resource_variable_ops.py:1817: calling BaseResourceVariable.__init__ (from tensorflow.python.ops.resource_variable_ops) with constraint is deprecated and will be removed in a future version.
Instructions for updating:
If using Keras pass *_constraint arguments to layers.
